In [34]:
import cx_Oracle
con = cx_Oracle.connect('ss15/p1234@localhost')

In [35]:
mycursor = con.cursor()

In [57]:
mycursor.execute("drop table relation")
mycursor.execute("drop table book")
mycursor.execute("drop table course")
mycursor.execute("drop table dept")

In [54]:
mycursor.execute("select table_name from user_tables")
for x in mycursor:
    print(x[0])
    # tt=f"drop table {x[0]}"
    # print(tt)
    # break
    # try:
        # mycursor.execute(tt)
    # except:
        # pass

ARTIST
ALBUM
SONG
CUSTOMERS
STUDENT
DEPT_120
TEST
DEPT2
DEMO2
COURSE2
DEPT3
MY_TABLE
MY_TABLE2
EVENTS
OBJECT
DEPT
COURSE
BOOK
RELATION

In [33]:
# mycursor.execute("SELECT table_name FROM user_tables")
mycursor.execute("select * from dept")
for x in mycursor:
    print(x)

In [19]:
# Check if dept table exists
mycursor.execute("SELECT COUNT(*) FROM user_tables WHERE table_name = 'DEPT'")
dept_table_exists = mycursor.fetchone()[0]
print(dept_table_exists)
if not dept_table_exists:
    mycursor.execute('''
        CREATE TABLE dept (
            dept_id INT,
            dept_name VARCHAR(20),
            faculty VARCHAR(30),
            no_of_student INT,
            PRIMARY KEY(dept_id)
        )
    ''')

# Check if course table exists
mycursor.execute("SELECT COUNT(*) FROM user_tables WHERE table_name = 'COURSE'")
course_table_exists = mycursor.fetchone()[0]

if not course_table_exists:
    mycursor.execute('''
        CREATE TABLE course (
            course_no VARCHAR(20),
            course_name VARCHAR(50),
            year_semester INT,
            credit DECIMAL(20,4),
            dept_id INT,
            PRIMARY KEY(course_no),
            FOREIGN KEY(dept_id) REFERENCES dept(dept_id)
        )
    ''')

# Check if book table exists
mycursor.execute("SELECT COUNT(*) FROM user_tables WHERE table_name = 'BOOK'")
book_table_exists = mycursor.fetchone()[0]

if not book_table_exists:
    mycursor.execute('''
        CREATE TABLE book (
            book_no INT,
            book_name VARCHAR(50),
            author VARCHAR(50),
            book_edition INT,
            course_offering INT,
            PRIMARY KEY(book_no)
        )
    ''')

# Check if relation table exists
mycursor.execute("SELECT COUNT(*) FROM user_tables WHERE table_name = 'RELATION'")
relation_table_exists = mycursor.fetchone()[0]

if not relation_table_exists:
    mycursor.execute('''
        CREATE TABLE relation (
            book_no INT,
            course_no VARCHAR(20),
            PRIMARY KEY(book_no, course_no),
            FOREIGN KEY(book_no) REFERENCES book(book_no),
            FOREIGN KEY(course_no) REFERENCES course(course_no)
        )
    ''')

0

In [20]:
# execute alter table command
mycursor.execute("ALTER TABLE dept ADD location CHAR(20)")
# modify column data type
mycursor.execute("ALTER TABLE dept MODIFY location VARCHAR(23)")
# rename column
mycursor.execute("ALTER TABLE dept RENAME COLUMN location TO location2")
# drop column
mycursor.execute("ALTER TABLE dept DROP COLUMN location2")

In [21]:
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (7, 'CSE', 'EE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (3, 'EEE', 'EE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (1, 'CE', 'CE', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (5, 'ME', 'ME', 120)")
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (2, 'ECE', 'EE', 60)")

In [22]:
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('CSE1101', 'discreate math', 11, 3.00, 7)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('CSE3105', 'database systems', 31, 3.00, 7)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('EEE1101', 'Basic electrical engineering', 11, 3.00, 3)")
mycursor.execute("INSERT INTO course (course_no, course_name, year_semester, credit, dept_id) VALUES ('ME3101', 'solid mechanics', 31, 3.00, 5)")

mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (12, 'discreate math', 'rosen', 4, 2)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (13, 'database systems', 'korth', 5, 1)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (14, 'data_communication', 'willim stallings', 6, 3)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (15, 'solid mechanics', 'john abraham', 3, 2)")
mycursor.execute("INSERT INTO book (book_no, book_name, author, book_edition, course_offering) VALUES (16, 'electrical engineering', 'boylsted', 8, 4)")

mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (12, 'CSE1101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (16, 'EEE1101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (15, 'ME3101')")
mycursor.execute("INSERT INTO relation (book_no, course_no) VALUES (13, 'CSE3105')")

In [23]:
mycursor.execute("SELECT * FROM dept WHERE no_of_student=120")
result = mycursor.fetchall()
for row in result:
  print(row)

(7, 'CSE', 'EE', 120)
(3, 'EEE', 'EE', 120)
(1, 'CE', 'CE', 120)
(5, 'ME', 'ME', 120)

In [24]:
# execute command
mycursor.execute("SELECT * FROM dept WHERE dept_id=(SELECT dept_id FROM course WHERE course_name='database systems')")

# fetch result
result = mycursor.fetchall()

# print result
for x in result:
  print(x)

(7, 'CSE', 'EE', 120)

In [25]:
mycursor.execute("UPDATE course SET course_name='Digital Electronics' WHERE course_no='EEE1101'")

In [26]:
mycursor.execute("INSERT INTO dept (dept_id, dept_name, faculty, no_of_student) VALUES (12, 'URP', 'CE', 60)")

mycursor.execute("DELETE FROM dept WHERE dept_id = 12")

In [4]:
mycursor.close()
con.close()